# Clinometer activity Pt 2: Calculating the class average

In this notebook you'll create a pandas dataframe with data from the entire class. You will practice using pandas functions and learn how to convert a CSV file to a pandas dataframe.

Start by importing pandas and numpy

In [1]:
import pandas as pd
import numpy as np

Next, let's open our data file and convert it to a pandas dataframe. 

This time our dataset is in a CSV file so we can use the pd.read_csv() function:

In [2]:
df_ex = pd.read_csv("class_planetarium_data.csv")

Let's take a look at the data! Find the first 5 rows of data:

In [3]:
df_ex.head()

   student height (m)  clinometer angle (deg) Unnamed: 2
0             1.61544                    30.0        NaN
1             1.70200                    32.0        NaN
2             1.75260                    31.0
3             1.72700                    30.0        NaN
4             1.55000                    30.0        NaN

Now check the data type of all the columns in the dataframe:

In [4]:
df_ex.dtypes

student height (m)        float64
clinometer angle (deg)    float64
Unnamed: 2                 object
dtype: object

The first column contains the height of everyone in the class.

Isolate this column using an index and assign it to a variable. Hint: You'll need to include the column name in the index.

In [5]:
student_height = df_ex[["student height (m)"]]

Now, print out the average class height:

In [15]:
avg_student = (student_height.mean())
print(avg_student)

student height (m)    1.646076
dtype: float64

## Adding columns: calculating theta
To make our data useful, we need to add some more columns. Let's create a column for theta first.

Recall that theta = np.deg2rad(degrees).

In [16]:
# Create a new column called "theta" 
# Hint: You will need to use a dataframe index as the argument for the np.deg2rad() function.
df_ex["theta"] = (np.deg2rad(df_ex["clinometer angle (deg)"]))

Check to make sure that you've added your new column correctly:

In [17]:
df_ex.head()

   student height (m)  clinometer angle (deg) Unnamed: 2     theta
0             1.61544                    30.0        NaN  0.523599
1             1.70200                    32.0        NaN  0.558505
2             1.75260                    31.0             0.541052
3             1.72700                    30.0        NaN  0.523599
4             1.55000                    30.0        NaN  0.523599

In [18]:
df = df_ex[["student height (m)", "clinometer angle (deg)", "theta"]]
df.head()

   student height (m)  clinometer angle (deg)     theta
0             1.61544                    30.0  0.523599
1             1.70200                    32.0  0.558505
2             1.75260                    31.0  0.541052
3             1.72700                    30.0  0.523599
4             1.55000                    30.0  0.523599

In [19]:
print(student_height)
student_height

    student height (m)
0              1.61544
1              1.70200
2              1.75260
3              1.72700
4              1.55000
5              1.60020
6              1.77800
7              1.66000
8              1.54940
9              1.53000
10             1.60020
11             1.65100
12             1.70600
13             1.73000
14             1.75000
15             1.62560
16             1.57480
17             1.70000
18             1.47320

    student height (m)
0              1.61544
1              1.70200
2              1.75260
3              1.72700
4              1.55000
5              1.60020
6              1.77800
7              1.66000
8              1.54940
9              1.53000
10             1.60020
11             1.65100
12             1.70600
13             1.73000
14             1.75000
15             1.62560
16             1.57480
17             1.70000
18             1.47320

Next, let's add a "building height" column. 

Remember that opposite = adjacent * np.tan(theta) and that the building height is opposite + student height.

In [22]:
# Create a new column called "building height"
# Hint: You will need to use THREE dataframe indexes to define this column
df["building height"] = (50.7*np.tan(df["theta"])) + 1.646076

Check to make sure that you've added your new column correctly:

In [23]:
print(df)

    student height (m)  clinometer angle (deg)     theta  building height
0              1.61544                    30.0  0.523599        30.917735
1              1.70200                    32.0  0.558505        33.326952
2              1.75260                    31.0  0.541052        32.109709
3              1.72700                    30.0  0.523599        30.917735
4              1.55000                    30.0  0.523599        30.917735
5              1.60020                    30.2  0.527089        31.154181
6              1.77800                    30.2  0.527089        31.154181
7              1.66000                    30.0  0.523599        30.917735
8              1.54940                    30.0  0.523599        30.917735
9              1.53000                    33.0  0.575959        34.571041
10             1.60020                    30.0  0.523599        30.917735
11             1.65100                    28.0  0.488692        28.603744
12             1.70600                    20.2  0.352557        20.300044
13             1.73000                    30.0  0.523599        30.917735
14             1.75000                    30.0  0.523599        30.917735
15             1.62560                    28.0  0.488692        28.603744
16             1.57480                    32.0  0.558505        33.326952
17             1.70000                    33.0  0.575959        34.571041
18             1.47320                    28.0  0.488692        28.603744

Now, find the average planetarium height for the entire class:

In [25]:
avg_height = df["building height"].mean()
print(avg_height)

30.71932686866674

In [27]:
print(avg_height,"is the height of the planetarium")

30.71932686866674 is the height of the planetarium